scalabilityTest.yml
config:
  target: "http://httpbin.org/"
  phases:
      name: Scalability 1
    - duration: 300
      arrivalRate: 1
      name: Scalability 2
    - duration: 300
      arrivalRate: 2
      name: Scalability 3
    - duration: 300
      arrivalRate: 3
      name: Scalability 4
    - duration: 300
      arrivalRate: 4
      name: Scalability 5
    - duration: 300
      arrivalRate: 5
  name: Artillery First Test
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "/get"
      - post:
          url: "/post"
          json:
            username: "Test User"
            password: "Temp Password"